Documents/ФормулярПервичногоДокументаПОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ФормулярПервичногоДокументаПОД</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаСведений</Name>
					<Comment>1 - MXL, 2 - PDF</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяЗадачаСоздатель</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормулярПервичногоДокументаПОДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФормуляра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВидаРегистраУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРегистраУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапВыполняетсяНесколькимиИсполнителями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ФормулярПервичногоДокументаПОД/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ФорматПоКодуВидаСведений = ПроцессыОбработкиДокументов.РасширениеФайлаФормуляра(Объект.КодВидаСведений);
	
	Если Объект.Ссылка.Пустая() Тогда

		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	ЭтотОбъект.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьЗаголовокФормы();

	ЗаполнитьФайлMXLФормуляра();
	
	ВывестиПредставлениеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()

	Если ЗначениеЗаполнено(Объект.НаименованиеВидаРегистраУчета) Тогда
		Заголовок = Объект.ОписаниеРегистраУчета;
	Иначе	
		СвойстваПредставления = Новый Структура;
		СвойстваПредставления.Вставить("НаименованиеДокумента", Объект.НаименованиеДокумента);
		СвойстваПредставления.Вставить("НомерДокумента", Объект.НомерДокумента);
		СвойстваПредставления.Вставить("ДатаДокумента", Объект.ДатаДокумента);
		
		ТекстЗаголовка = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеФормуляраПоСвойствам(
			СвойстваПредставления, Объект.Ссылка.Пустая());
			
		ДополнениеЗаголовка = ПроцессыОбработкиДокументовКлиентСервер.ДополнениеНаименованияФормуляра(Объект.КодВидаСведений);	
		Заголовок = СтрШаблон("%1%2", ТекстЗаголовка, ДополнениеЗаголовка);		
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Процедура ВывестиПредставлениеДокумента()
	
	Если Объект.Ссылка.Пустая()
		И НЕ ЗначениеЗаполнено(АдресОсновногоФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = ДвоичныеДанныеЭлектронногоДокумента();
	
	Если ДвоичныеДанные = Неопределено Тогда
		
		ТабличныйДокументОсновной.Очистить();
		АдресОсновногоФайла = "";
		АдресТабличногоДокумента = "";
		
		ТекстСообщения = НСтр("ru = 'Не удалось получить данные формуляра.
			|Для продолжения работы с формуляром необходимо снять пометку удаления.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	АдресОсновногоФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
 	ТабличныйДокументОсновной = ПроцессыОбработкиДокументовВызовСервера.ТабличныйДокументПоДвоичнымДанным(ДвоичныеДанные);
	
	АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеЭлектронногоДокумента()
	Если Объект.КодВидаСведений = 1 Тогда
		Возврат РаботаСФайлами.ДвоичныеДанныеФайла(Объект.ОсновнойФайл, Ложь);
	ИначеЕсли Объект.КодВидаСведений = 2 Тогда
		Если ЗначениеЗаполнено(ФайлMXLФормуляра) Тогда
			Возврат РаботаСФайлами.ДвоичныеДанныеФайла(ФайлMXLФормуляра, Ложь);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ЗаполнитьФайлMXLФормуляра()
	Если Объект.КодВидаСведений = 2 Тогда
		ПрисоединенныеФайлыФормуляраПервичногоДокумента = ПроцессыОбработкиДокументов.ПрисоединенныеФайлыФормуляраПервичногоДокумента(Объект.Предмет, Объект.ИдентификаторФормуляра);
		ФайлMXLФормуляра = ПрисоединенныеФайлыФормуляраПервичногоДокумента.ФайлMXL;
		ФайлPDFФормуляра = ПрисоединенныеФайлыФормуляраПервичногоДокумента.ФайлPDF;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
